; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v12 ?v9)
             (pred_2 ?v5 ?v13)
             (pred_5 ?v12 ?v13)
             (pred_4 ?v8 ?v12 )
	     (pred_6 ?v12)
             (pred_3 ?v11)
             (pred_9 ?v5)
             (pred_10 ?v13)
             (pred_11 ?v12)
             (pred_8 ?v5)
             (pred_1 ?v12)
             (pred_7 ))



(:action op_3
:parameters (?v3 ?v10 ?v7 ?v1)
:precondition (and (pred_3 ?v3) (pred_3 ?v10) (pred_9 ?v7) (pred_10 ?v1)
          (pred_12 ?v3 ?v10) (pred_2 ?v7 ?v1)
                   (pred_5 ?v10 ?v1) (pred_6 ?v3) 
                   (pred_11 ?v10) (pred_8 ?v7))
:effect (and  (pred_1 ?v10) (not (pred_11 ?v10))))


(:action op_2
:parameters (?v3 ?v4)
:precondition (and (pred_3 ?v3) (pred_3 ?v4)
               (pred_6 ?v3) (pred_12 ?v3 ?v4) (pred_1 ?v4))
:effect (and (pred_6 ?v4) (not (pred_6 ?v3))))

(:action op_5
:parameters (?v3 ?v7)
:precondition (and (pred_3 ?v3) (pred_9 ?v7) 
                  (pred_6 ?v3) (pred_4 ?v7 ?v3) (pred_7 ))
:effect (and (pred_8 ?v7)
   (not (pred_4 ?v7 ?v3)) (not (pred_7 ))))


(:action op_1
:parameters (?v3 ?v6 ?v2)
:precondition (and (pred_3 ?v3) (pred_9 ?v6) (pred_9 ?v2)
                  (pred_6 ?v3) (pred_8 ?v2) (pred_4 ?v6 ?v3))
:effect (and (pred_8 ?v6) (pred_4 ?v2 ?v3)
        (not (pred_8 ?v2)) (not (pred_4 ?v6 ?v3))))

(:action op_4
:parameters (?v3 ?v7)
:precondition (and (pred_3 ?v3) (pred_9 ?v7) 
                  (pred_6 ?v3) (pred_8 ?v7))
:effect (and (pred_7 ) (pred_4 ?v7 ?v3) (not (pred_8 ?v7)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_09 obj_01 obj_05 obj_20 obj_04 obj_10 obj_08 obj_03 obj_13 obj_15 obj_07 obj_14 obj_19 obj_12 obj_17
    obj_02 obj_18
    obj_16 obj_21 obj_06
    )

    (:init
       (pred_7)

       (pred_3 obj_11)
       (pred_3 obj_09)
       (pred_3 obj_01)
       (pred_3 obj_05)
       (pred_3 obj_20)
       (pred_3 obj_04)
       (pred_3 obj_10)
       (pred_3 obj_08)
       (pred_3 obj_03)
       (pred_3 obj_13)
       (pred_3 obj_15)
       (pred_3 obj_07)
       (pred_3 obj_14)
       (pred_3 obj_19)
       (pred_3 obj_12)
       (pred_3 obj_17)
       (pred_10 obj_02)
       (pred_10 obj_18)
       (pred_9 obj_16)
       (pred_9 obj_21)
       (pred_9 obj_06)

       (pred_12 obj_11 obj_20)
       (pred_12 obj_11 obj_09)
       (pred_12 obj_09 obj_04)
       (pred_12 obj_09 obj_01)
       (pred_12 obj_09 obj_11)
       (pred_12 obj_01 obj_10)
       (pred_12 obj_01 obj_05)
       (pred_12 obj_01 obj_09)
       (pred_12 obj_05 obj_08)
       (pred_12 obj_05 obj_01)
       (pred_12 obj_20 obj_03)
       (pred_12 obj_20 obj_04)
       (pred_12 obj_20 obj_11)
       (pred_12 obj_04 obj_13)
       (pred_12 obj_04 obj_10)
       (pred_12 obj_04 obj_09)
       (pred_12 obj_04 obj_20)
       (pred_12 obj_10 obj_15)
       (pred_12 obj_10 obj_08)
       (pred_12 obj_10 obj_01)
       (pred_12 obj_10 obj_04)
       (pred_12 obj_08 obj_07)
       (pred_12 obj_08 obj_05)
       (pred_12 obj_08 obj_10)
       (pred_12 obj_03 obj_14)
       (pred_12 obj_03 obj_13)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_13 obj_19)
       (pred_12 obj_13 obj_15)
       (pred_12 obj_13 obj_04)
       (pred_12 obj_13 obj_03)
       (pred_12 obj_15 obj_12)
       (pred_12 obj_15 obj_07)
       (pred_12 obj_15 obj_10)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_07 obj_17)
       (pred_12 obj_07 obj_08)
       (pred_12 obj_07 obj_15)
       (pred_12 obj_14 obj_19)
       (pred_12 obj_14 obj_03)
       (pred_12 obj_19 obj_12)
       (pred_12 obj_19 obj_13)
       (pred_12 obj_19 obj_14)
       (pred_12 obj_12 obj_17)
       (pred_12 obj_12 obj_15)
       (pred_12 obj_12 obj_19)
       (pred_12 obj_17 obj_07)
       (pred_12 obj_17 obj_12)
       (pred_11 obj_08)
       (pred_11 obj_19)
       (pred_11 obj_10)
       (pred_5  obj_08 obj_02)
       (pred_5  obj_19 obj_18)
       (pred_5  obj_10 obj_02)
       (pred_1 obj_11)
       (pred_1 obj_09)
       (pred_1 obj_01)
       (pred_1 obj_05)
       (pred_1 obj_20)
       (pred_1 obj_04)
       (pred_1 obj_03)
       (pred_1 obj_13)
       (pred_1 obj_15)
       (pred_1 obj_07)
       (pred_1 obj_14)
       (pred_1 obj_12)
       (pred_1 obj_17)

       (pred_2  obj_16 obj_02)
       (pred_2  obj_21 obj_18)
       (pred_2  obj_06 obj_02)
       (pred_4 obj_16 obj_05)
       (pred_4 obj_21 obj_09)
       (pred_4 obj_06 obj_04)
       (pred_6 obj_03)
    )

    (:goal (and
       (pred_4 obj_16 obj_09)
       (pred_4 obj_06 obj_17)
    ))
(:constraints
  (always (not (pred_6 obj_08)))
)
)

; plan
1. (op_2 obj_03 obj_13)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_13)
   goals met: 0 of 2
2. (op_2 obj_13 obj_04)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_04)
   goals met: 0 of 2
3. (op_5 obj_04 obj_06)
   deleted: (pred_4 obj_06 obj_04) (pred_7)
   added: (pred_8 obj_06)
   goals met: 0 of 2
4. (op_2 obj_04 obj_09)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_09)
   goals met: 0 of 2
5. (op_2 obj_09 obj_01)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_01)
   goals met: 0 of 2
6. (op_2 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_05)
   goals met: 0 of 2
7. (op_3 obj_05 obj_08 obj_06 obj_02)
   deleted: (pred_11 obj_08)
   added: (pred_1 obj_08)
   goals met: 0 of 2
8. (op_1 obj_05 obj_16 obj_06)
   deleted: (pred_8 obj_06) (pred_4 obj_16 obj_05)
   added: (pred_8 obj_16) (pred_4 obj_06 obj_05)
   goals met: 0 of 2
9. (op_2 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_01)
   goals met: 0 of 2
10. (op_2 obj_01 obj_09)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_09)
   goals met: 0 of 2
11. (op_4 obj_09 obj_16)
   deleted: (pred_8 obj_16)
   added: (pred_7) (pred_4 obj_16 obj_09)
   goals met: 1 of 2
12. (op_2 obj_09 obj_01)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_01)
   goals met: 1 of 2
13. (op_2 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_05)
   goals met: 1 of 2
14. (op_5 obj_05 obj_06)
   deleted: (pred_4 obj_06 obj_05) (pred_7)
   added: (pred_8 obj_06)
   goals met: 1 of 2
15. (op_2 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_01)
   goals met: 1 of 2
16. (op_3 obj_01 obj_10 obj_06 obj_02)
   deleted: (pred_11 obj_10)
   added: (pred_1 obj_10)
   goals met: 1 of 2
17. (op_2 obj_01 obj_10)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_10)
   goals met: 1 of 2
18. (op_2 obj_10 obj_15)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_15)
   goals met: 1 of 2
19. (op_2 obj_15 obj_07)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_07)
   goals met: 1 of 2
20. (op_2 obj_07 obj_17)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_17)
   goals met: 1 of 2
21. (op_4 obj_17 obj_06)
   deleted: (pred_8 obj_06)
   added: (pred_7) (pred_4 obj_06 obj_17)
   goals met: 2 of 2
